app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
	<ul>
	  <% @article.comments.each do |comment| %>