app/controllers/articles_controller.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 0], ["updated_at", "2015-11-03 21:05:25.929383"], ["id", 3]]
---
  def show
    @article.update_visits_count

SELECT "categories".* FROM "categories"
---
  def new
    @article = Article.new
    @categories = Category.all

INSERT INTO "articles" ("title", "body", "user_id", "visits_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asass"], ["body", "asssfff"], ["user_id", 1], ["visits_count", 0], ["created_at", "2015-11-03 21:04:40.170763"], ["updated_at", "2015-11-03 21:04:40.170763"]]
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["article_id", 1], ["created_at", "2015-11-11 05:44:31.010107"], ["updated_at", "2015-11-11 05:44:31.010107"]]
---
  def create
    @article = current_user.articles.new(article_params)
    @article.categories = params[:categories]

    respond_to do |format|
      if @article.save