app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asasasasffffffff"], ["user_id", 1], ["article_id", 15], ["created_at", "2015-11-04 06:32:21.423377"], ["updated_at", "2015-11-04 06:32:21.423377"]]

    def set_article
      @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 15]]